
#########################################

df_emp_all_emp |> 
  View()

df_emp_all_emp |> 
  glimpse()

df_emp_all_emp |>
  #  filter(is.na(`산업분류(대분류)`) == FALSE) |>
  group_by(장애인코드, `산업분류(대분류)`) |>
  summarise(건보취업자수 = sum(`취업자(건보가입자)`), 
            `유지취업자1차` = sum(`1차유지자수`), 
            `유지취업율1차`= sum(`1차유지자수`) / sum(`취업자(건보가입자)`),
            `유지취업자2차` = sum(`2차유지자수`), 
            `유지취업율2차`= sum(`2차유지자수`) / sum(`취업자(건보가입자)`),
            `유지취업자3차` = sum(`3차유지자수`), 
            `유지취업율3차`= sum(`3차유지자수`) / sum(`취업자(건보가입자)`),
            `유지취업자4차` = sum(`4차유지자수`), 
            `유지취업율4차`= sum(`4차유지자수`) / sum(`취업자(건보가입자)`)
  ) |>
  write_clip()



#########################################

df_emp_all_emp |>
  #  filter(is.na(`산업분류(대분류)`) == FALSE) |>
  group_by(장애인코드, 임금수준) |>
  summarise(건보취업자수 = sum(`취업자(건보가입자)`), 
                  `유지취업율1차`= sum(`1차유지자수`) / sum(`취업자(건보가입자)`),
                  `유지취업율2차`= sum(`2차유지자수`) / sum(`취업자(건보가입자)`),
                  `유지취업율3차`= sum(`3차유지자수`) / sum(`취업자(건보가입자)`),
                  `유지취업율4차`= sum(`4차유지자수`) / sum(`취업자(건보가입자)`)
  ) |>
  write_clip()


#########################################

df_emp_all_emp |>
  #  filter(is.na(`산업분류(대분류)`) == FALSE) |>
  group_by(장애인코드, 기업규모) |>
  summarise(건보취업자수 = sum(`취업자(건보가입자)`), 
                  `유지취업율1차`= sum(`1차유지자수`) / sum(`취업자(건보가입자)`),
                  `유지취업율2차`= sum(`2차유지자수`) / sum(`취업자(건보가입자)`),
                  `유지취업율3차`= sum(`3차유지자수`) / sum(`취업자(건보가입자)`),
                  `유지취업율4차`= sum(`4차유지자수`) / sum(`취업자(건보가입자)`)
  ) |>
  write_clip()


#########################################

df_emp_all_emp |>
  #  filter(is.na(`산업분류(대분류)`) == FALSE) |>
  group_by(장애인코드, 취업준비기간) |>
  summarise(건보취업자수 = sum(`취업자(건보가입자)`), 
                  `유지취업율1차`= sum(`1차유지자수`) / sum(`취업자(건보가입자)`),
                  `유지취업율2차`= sum(`2차유지자수`) / sum(`취업자(건보가입자)`),
                  `유지취업율3차`= sum(`3차유지자수`) / sum(`취업자(건보가입자)`),
                  `유지취업율4차`= sum(`4차유지자수`) / sum(`취업자(건보가입자)`)
  ) |>
  write_clip()


#########################################

df_emp_all_emp |>
  #  filter(is.na(`산업분류(대분류)`) == FALSE) |>
  group_by(장애인코드, 기업유형) |>
  summarise(건보취업자수 = sum(`취업자(건보가입자)`), 
                  `유지취업율1차`= sum(`1차유지자수`) / sum(`취업자(건보가입자)`),
                  `유지취업율2차`= sum(`2차유지자수`) / sum(`취업자(건보가입자)`),
                  `유지취업율3차`= sum(`3차유지자수`) / sum(`취업자(건보가입자)`),
                  `유지취업율4차`= sum(`4차유지자수`) / sum(`취업자(건보가입자)`)
  ) |>
  write_clip()



#########################################

df_emp_all_emp$근무지역 <- fct_relevel(df_emp_all$근무지역, '서울', '부산', '대구', '인천', '광주', '대전', '울산', '세종', 
                                   '경기', '강원', '충북', '충남', '전북', '전남', '경북', '경남', '제주')

df_emp_all_emp |>
  distinct(근무지역)


df_emp_all_emp |>
  #  filter(is.na(`산업분류(대분류)`) == FALSE) |>
  group_by(장애인코드, 근무지역) |>
  summarise(건보취업자수 = sum(`취업자(건보가입자)`), 
                  `유지취업율1차`= sum(`1차유지자수`) / sum(`취업자(건보가입자)`),
                  `유지취업율2차`= sum(`2차유지자수`) / sum(`취업자(건보가입자)`),
                  `유지취업율3차`= sum(`3차유지자수`) / sum(`취업자(건보가입자)`),
                  `유지취업율4차`= sum(`4차유지자수`) / sum(`취업자(건보가입자)`)
  ) |>
  write_clip()
