library(tidyverse)
library(showtext)
showtext_auto()
library(readxl)
library(clipr)

df_emp_all <- read_excel('D:/R/data/Vulnerable/Vulnerable1.xlsx', sheet = 'Sheet1', skip = 3, 
                         col_names = TRUE, col_types = c(rep('text', 24), rep('numeric', 27)))

glimpse(df_emp_all)

df_emp_all <- df_emp_all |>
  mutate(출신고교지역 = ifelse(출신고교지역 == '-', '미상', 출신고교지역))

df_emp_all <- df_emp_all |>
  filter(외국인유학생여부 == 'N')

df_emp_all <- df_emp_all |>
  mutate_if(is.numeric, ~replace(., is.na(.), 0))

df_emp_all <- df_emp_all |>
  mutate_if(is.character, as.factor)


df_emp_all <- df_emp_all |>
  mutate(all_sum = `건보취업자 수 총합` + `총합계` - `외국인유학생`)

df_emp_all |>
  group_by(장애인코드) |>
  summarise(sum = sum(all_sum)) |>
  mutate(percentage = sum/sum(sum)) |>
  write_clip()

df_emp_all$학교지역 <- fct_relevel(df_emp_all$학교지역, '서울', '부산', '대구', '인천', '광주', '대전', '울산', '세종', 
                               '경기', '강원', '충북', '충남', '전북', '전남', '경북', '경남', '제주')

df_emp_all$설립구분 <- fct_relevel(df_emp_all$설립구분, '국립', '공립', '사립')

df_emp_all$학제 <- fct_relevel(df_emp_all$학제, '전문대학', '교육대학', '대학', 
                             '일반대학원', '기능대학', '각종대학(대학)', 
                             '산업대학')

df_emp_all$학교졸업생규모 <- fct_relevel(df_emp_all$학교졸업생규모, '500명미만', '500명이상-1000명미만', '1000명이상-1500명미만', 
                                  '1500명이상-2000명미만', '2000명이상-2500명미만', '2500명이상-3000명미만', 
                                  '3000명이상-3500명미만', '3500명이상-4000명미만', '4000명이상')

df_emp_all$학과대분류 <- fct_relevel(df_emp_all$학과대분류, '인문계열', '사회계열', '교육계열', 
                                '자연계열', '공학계열', '의약계열', '예체능계열')

df_emp_all <- df_emp_all |>
  mutate(학제과정 = case_when(
    학제 == '전문대학' ~ '전문대학과정', 
    학제 %in% c('교육대학', '대학', '기능대학', '각종대학(대학)', '산업대학') ~ '대학과정', 
    학제 == '일반대학원' ~ '대학원과정'
  ))

df_emp_all$학제과정 <- fct_relevel(df_emp_all$학제과정, '전문대학과정', '대학과정', '대학원과정') 

df_emp_all$거주지역 <- fct_relevel(df_emp_all$거주지역, '서울', '부산', '대구', '인천', '광주', '대전', '울산', '세종', 
                               '경기', '강원', '충북', '충남', '전북', '전남', '경북', '경남', '제주', '미상')

df_emp_all$출신고교지역 <- fct_relevel(df_emp_all$출신고교지역, '서울', '부산', '대구', '인천', '광주', '대전', '울산', '세종', '경기', '강원', '충북', '충남', '전북', '전남', '경북', '경남', '제주', '해외', '미상')

######################################################

glimpse(df_emp_all)

df_emp_all_emp <- df_emp_all |>
  mutate(취업률분자 = `건보취업자 수 총합` + `취업자(해외취업자)` + `취업자(개인창작)` + `취업자(농림어업종사자)` + `취업자(1인창(사)업자)` + `취업자(프리랜서)`, 
         취업률분모 = `건보취업자 수 총합` + `총합계` - `진학자(국내-전문대학)` - `진학자(국내-대학)` - `진학자(국내-대학원)` - `진학자(국외-전문대학)` - `진학자(국외-대학)` - `진학자(국외-대학원)` - 입대자 - 취업불가능자 - 제외인정자 - 외국인유학생)

df_emp_all_emp |>
  group_by(장애인코드) |>
  summarise(건보취업자수 = sum(`건보취업자 수 총합`), 
            해외취업자수 = sum(`취업자(해외취업자)`), 
            농림어업종사자수 = sum(`취업자(농림어업종사자)`), 
            개인창작활동종사자수 = sum(`취업자(개인창작)`), 
            `1인창사업자수` = sum(`취업자(1인창(사)업자)`), 
            프리랜서수 = sum(`취업자(프리랜서)`), 
            졸업자수 = sum(`건보취업자 수 총합` + `총합계`), 
            진학자수 = sum(`진학자(국내-전문대학)` + `진학자(국내-대학)` + `진학자(국내-대학원)` + `진학자(국외-전문대학)` + `진학자(국외-대학)` + `진학자(국외-대학원)`), 
            입대자수 = sum(입대자), 
            취업불가능자수 = sum(취업불가능자), 
            제외인정자수 = sum(제외인정자), 
            외국인유학생 = sum(외국인유학생),
            기타 = sum(기타), 
            미상 = sum(미상), 
            취업률 = sum(취업률분자)/sum(취업률분모)) |>
  write_clip()

df_emp_all_emp |>
  group_by(장애인코드) |>
  summarise(건보취업자수 = sum(`건보취업자 수 총합`), 
                  해외취업자수 = sum(`취업자(해외취업자)`), 
                  농림어업종사자수 = sum(`취업자(농림어업종사자)`), 
                  개인창작활동종사자수 = sum(`취업자(개인창작)`), 
                  `1인창사업자수` = sum(`취업자(1인창(사)업자)`), 
                  프리랜서수 = sum(`취업자(프리랜서)`), 
#                  졸업자수 = sum(`건보취업자 수 총합` + `총합계`), 
                  진학자수 = sum(`진학자(국내-전문대학)` + `진학자(국내-대학)` + `진학자(국내-대학원)` + `진학자(국외-전문대학)` + `진학자(국외-대학)` + `진학자(국외-대학원)`), 
                  입대자수 = sum(입대자), 
                  취업불가능자수 = sum(취업불가능자), 
                  제외인정자수 = sum(제외인정자), 
                  외국인유학생 = sum(외국인유학생),
                  기타 = sum(기타), 
                  미상 = sum(미상)) |>
  pivot_longer(2:14, names_to = '구분', values_to = '졸업생수') |>
  mutate(구분 = fct_relevel(구분, '건보취업자수', '해외취업자수', '농림어업종사자수', '개인창작활동종사자수', '1인창사업자수', '프리랜서수', '진학자수', '입대자수', '취업불가능자수', '외국인유학생', '기타', '미상')) |>
  group_by(장애인코드) |>
  mutate(pos = 졸업생수 / sum(졸업생수)) |>
  mutate(pos1 = cumsum(pos) - 0.5 * pos) |>
  ungroup() |>
  ggplot(aes(x = 졸업생수, y = 장애인코드)) +
  geom_col(aes(fill = 구분), position = position_fill(reverse = TRUE)) + 
  geom_text(aes(x = pos1, label = 졸업생수), size = 4) +  theme_classic() +
  theme(legend.position="bottom",legend.title = element_blank())


#########################################

df_emp_all_emp |>
  group_by(장애인코드) |>
  summarise(건보취업자수 = sum(`건보취업자 수 총합`) / sum(취업률분자), 
            해외취업자수 = sum(`취업자(해외취업자)`) / sum(취업률분자), 
            농림어업종사자수 = sum(`취업자(농림어업종사자)`) / sum(취업률분자), 
            개인창작활동종사자수 = sum(`취업자(개인창작)`) / sum(취업률분자), 
            `1인창사업자수` = sum(`취업자(1인창(사)업자)`) / sum(취업률분자), 
            프리랜서수 = sum(`취업자(프리랜서)`) / sum(취업률분자), 
            취업률 = sum(취업률분자)/sum(취업률분모)
  ) |>
  write_clip()

df_emp_all_emp |>
  group_by(장애인코드) |>
  summarise(건보취업자수 = sum(`건보취업자 수 총합`) / sum(취업률분자), 
                  해외취업자수 = sum(`취업자(해외취업자)`) / sum(취업률분자), 
                  농림어업종사자수 = sum(`취업자(농림어업종사자)`) / sum(취업률분자), 
                  개인창작활동종사자수 = sum(`취업자(개인창작)`) / sum(취업률분자), 
                  `1인창사업자수` = sum(`취업자(1인창(사)업자)`) / sum(취업률분자), 
                  프리랜서수 = sum(`취업자(프리랜서)`) / sum(취업률분자), 
                  취업률 = sum(취업률분자)/sum(취업률분모)
  )
                  
#########################################

df_emp_all_emp |>
  group_by(장애인코드, 학교지역) |>
  summarise(건보취업자수 = sum(`건보취업자 수 총합`) / sum(취업률분자), 
                  해외취업자수 = sum(`취업자(해외취업자)`) / sum(취업률분자), 
                  농림어업종사자수 = sum(`취업자(농림어업종사자)`) / sum(취업률분자), 
                  개인창작활동종사자수 = sum(`취업자(개인창작)`) / sum(취업률분자), 
                  `1인창사업자수` = sum(`취업자(1인창(사)업자)`) / sum(취업률분자), 
                  프리랜서수 = sum(`취업자(프리랜서)`) / sum(취업률분자), 
                  취업률 = sum(취업률분자)/sum(취업률분모)
  ) |>
  write_clip()

#########################################

df_emp_all_emp |>
  group_by(장애인코드, 설립구분) |>
  summarise(건보취업자수 = sum(`건보취업자 수 총합`) / sum(취업률분자), 
                  해외취업자수 = sum(`취업자(해외취업자)`) / sum(취업률분자), 
                  농림어업종사자수 = sum(`취업자(농림어업종사자)`) / sum(취업률분자), 
                  개인창작활동종사자수 = sum(`취업자(개인창작)`) / sum(취업률분자), 
                  `1인창사업자수` = sum(`취업자(1인창(사)업자)`) / sum(취업률분자), 
                  프리랜서수 = sum(`취업자(프리랜서)`) / sum(취업률분자), 
                  취업률 = sum(취업률분자)/sum(취업률분모)
  ) |>
  write_clip()

#########################################

df_emp_all_emp |>
  group_by(장애인코드, 학과대분류) |>
  summarise(건보취업자수 = sum(`건보취업자 수 총합`) / sum(취업률분자), 
                  해외취업자수 = sum(`취업자(해외취업자)`) / sum(취업률분자), 
                  농림어업종사자수 = sum(`취업자(농림어업종사자)`) / sum(취업률분자), 
                  개인창작활동종사자수 = sum(`취업자(개인창작)`) / sum(취업률분자), 
                  `1인창사업자수` = sum(`취업자(1인창(사)업자)`) / sum(취업률분자), 
                  프리랜서수 = sum(`취업자(프리랜서)`) / sum(취업률분자), 
                  취업률 = sum(취업률분자)/sum(취업률분모)
  ) |>
  write_clip()


#########################################

df_emp_all_emp <- df_emp_all_emp |>
  mutate(학제과정 = case_when(
    학제 == '전문대학' ~ '전문대학과정', 
    학제 %in% c('교육대학', '대학', '기능대학', '각종대학(대학)', '산업대학') ~ '대학과정', 
    학제 == '일반대학원' ~ '대학원과정'
  ))

df_emp_all_emp$학제과정 <- fct_relevel(df_emp_all_emp$학제과정, '전문대학과정', '대학과정', '대학원과정') 


df_emp_all_emp |>
  group_by(장애인코드, 학제과정) |>
  summarise(건보취업자수 = sum(`건보취업자 수 총합`) / sum(취업률분자), 
                  해외취업자수 = sum(`취업자(해외취업자)`) / sum(취업률분자), 
                  농림어업종사자수 = sum(`취업자(농림어업종사자)`) / sum(취업률분자), 
                  개인창작활동종사자수 = sum(`취업자(개인창작)`) / sum(취업률분자), 
                  `1인창사업자수` = sum(`취업자(1인창(사)업자)`) / sum(취업률분자), 
                  프리랜서수 = sum(`취업자(프리랜서)`) / sum(취업률분자), 
                  취업률 = sum(취업률분자)/sum(취업률분모)
  ) |>
  write_clip()


#######################################################

distinct(df_emp_all_emp, 거주지역)

df_emp_all_emp$거주지역 <- fct_relevel(df_emp_all$거주지역, '서울', '부산', '대구', '인천', '광주', '대전', '울산', '세종', 
                               '경기', '강원', '충북', '충남', '전북', '전남', '경북', '경남', '제주', '미상')

df_emp_all_emp |>
  group_by(장애인코드, 거주지역) |>
  summarise(건보취업자수 = sum(`건보취업자 수 총합`) / sum(취업률분자), 
                  해외취업자수 = sum(`취업자(해외취업자)`) / sum(취업률분자), 
                  농림어업종사자수 = sum(`취업자(농림어업종사자)`) / sum(취업률분자), 
                  개인창작활동종사자수 = sum(`취업자(개인창작)`) / sum(취업률분자), 
                  `1인창사업자수` = sum(`취업자(1인창(사)업자)`) / sum(취업률분자), 
                  프리랜서수 = sum(`취업자(프리랜서)`) / sum(취업률분자), 
                  취업률 = sum(취업률분자)/sum(취업률분모)
  ) |>
  write_clip()

#######################################################

distinct(df_emp_all_emp, 출신고교지역)

df_emp_all_emp$출신고교지역 <- fct_relevel(df_emp_all_emp$출신고교지역, '서울', '부산', '대구', '인천', '광주', '대전', '울산', '세종', '경기', '강원', '충북', '충남', '전북', '전남', '경북', '경남', '제주', '해외', '미상')

df_emp_all_emp |>
  mutate(대학_거주 = case_when(
    as.character(거주지역) == as.character(학교지역) ~ 1,
    TRUE ~ 0
  )
  ) |>
  group_by(장애인코드, 대학_거주) |>
  summarise(건보취업자수 = sum(`건보취업자 수 총합`) / sum(취업률분자), 
                  해외취업자수 = sum(`취업자(해외취업자)`) / sum(취업률분자), 
                  농림어업종사자수 = sum(`취업자(농림어업종사자)`) / sum(취업률분자), 
                  개인창작활동종사자수 = sum(`취업자(개인창작)`) / sum(취업률분자), 
                  `1인창사업자수` = sum(`취업자(1인창(사)업자)`) / sum(취업률분자), 
                  프리랜서수 = sum(`취업자(프리랜서)`) / sum(취업률분자), 
                  취업률 = sum(취업률분자)/sum(취업률분모)
  ) |>
  write_clip()

df_emp_all |>
  mutate(대학_고교 = case_when(
    as.character(출신고교지역) == as.character(학교지역) ~ 1,
    TRUE ~ 0
  )
  ) |> 
  group_by(장애인코드, 학교지역, 대학_고교) |>
  summarise(sum = sum(all_sum)) |>
  mutate(percentage = sum/sum(sum)) |>
  write_clip()


#########################################

df_emp_all_emp |>
  group_by(장애인코드, 졸업평점) |>
  summarise(건보취업자수 = sum(`건보취업자 수 총합`) / sum(취업률분자), 
                  해외취업자수 = sum(`취업자(해외취업자)`) / sum(취업률분자), 
                  농림어업종사자수 = sum(`취업자(농림어업종사자)`) / sum(취업률분자), 
                  개인창작활동종사자수 = sum(`취업자(개인창작)`) / sum(취업률분자), 
                  `1인창사업자수` = sum(`취업자(1인창(사)업자)`) / sum(취업률분자), 
                  프리랜서수 = sum(`취업자(프리랜서)`) / sum(취업률분자), 
                  취업률 = sum(취업률분자)/sum(취업률분모)
  ) |>
  write_clip()




